
####################################################################################
# Constraints
# ----------------------------------------------------------------------------
#
# 0. Design Compiler variables
#
# 1. Master Clock Definitions
#
# 2. Generated Clock Definitions
#
# 3. Clock Uncertainties
#
# 4. Clock Latencies 
#
# 5. Clock Relationships
#
# 6. #set input/output delay on ports
#
# 7. Driving cells
#
# 8. Output load

####################################################################################
           #########################################################
                  #### Section 0 : DC Variables ####
           #########################################################
#################################################################################### 

# Prevent assign statements in the generated netlist (must be applied before compile command)
set_fix_multiple_port_nets -all -buffer_constants -feedthroughs

####################################################################################
           #########################################################
                  #### Section 1 : Clock Definition ####
           #########################################################
#################################################################################### 
# 1. Master Clock Definitions 
# 2. Generated Clock Definitions
# 3. Clock Latencies
# 4. Clock Uncertainties
# 4. Clock Transitions
####################################################################################
set CLK_PER_UART 271.2
set CLK_PER_REF 20

#1. Master Clocks

create_clock -period $CLK_PER_REF -name CLK_REF [get_ports REF_CLK]
create_clock -period $CLK_PER_UART -name CLK_UART [get_ports UART_CLK]

#2. Generated clocks

create_generated_clock -master_clock "CLK_UART" -source [get_ports UART_CLK] -name "TX_CLK" [get_port U0_ClkDiv/o_div_clk] -divide_by 32

create_generated_clock -master_clock "CLK_UART" -source [get_ports UART_CLK] -name "RX_CLK" [get_port U1_ClkDiv/o_div_clk] -divide_by 1

create_generated_clock -master_clock "CLK_REF" -source [get_ports REF_CLK] -name "ALU_CLK" [get_port U0_CLK_GATE/GATED_CLK] -divide_by 1

set_clock_latency 0 [get_clocks CLK_REF CLK_UART]

set_clock_uncertainty -setup 0.2 [get_clocks [list CLK_REF CLK_UART ALU_CLK TX_CLK RX_CLK]]

set_clock_uncertainty -hold 0.1 [get_clocks [list CLK_REF CLK_UART ALU_CLK TX_CLK RX_CLK]]

set_clock_transition 0.05 [get_clocks [list CLK_REF CLK_UART]]

set_dont_touch_network [get_clocks [list CLK_REF CLK_UART ALU_CLK TX_CLK RX_CLK]]


####################################################################################
           #########################################################
             #### Section 2 : Clocks Relationship ####
           #########################################################
####################################################################################

set_clock_groups -asynchronous -group "CLK_REF ALU_CLK" -group "CLK_UART TX_CLK RX_CLK"

####################################################################################
           #########################################################
             #### Section 3 : set input/output delay on ports ####
           #########################################################
####################################################################################

set in_delay_UART  [expr 0.2*$CLK_PER_UART]
set out_delay_UART [expr 0.2*$CLK_PER_UART]
set out_delay_UART_TX [expr 0.2*$CLK_PER_UART*32]

set_input_delay $in_delay_UART -clock RX_CLK [get_ports "UART_RX_IN"]

set_output_delay $out_delay_UART -clock RX_CLK [get_ports "RX_Error"]

set_output_delay $out_delay_UART_TX -clock TX_CLK [get_ports "UART_TX_O"]


####################################################################################
           #########################################################
                  #### Section 4 : Driving cells ####
           #########################################################
####################################################################################

set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c  [get_ports "UART_RX_IN"]

####################################################################################
           #########################################################
                  #### Section 5 : Output load ####
           #########################################################
####################################################################################

set_load 0.1 [get_ports "RX_Error UART_TX_O"]

####################################################################################
           #########################################################
                 #### Section 6 : Operating Condition ####
           #########################################################
####################################################################################

# Define the Worst Library for Max(#setup) analysis
# Define the Best Library for Min(hold) analysis

set_operating_conditions -min_library "scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c" -min "scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c" -max_library "scmetro_tsmc_cl013g_rvt_ss_1p08v_125c" -max "scmetro_tsmc_cl013g_rvt_ss_1p08v_125c"

####################################################################################
           #########################################################
                  #### Section 7 : wireload Model ####
           #########################################################
####################################################################################


####################################################################################
           #########################################################
                  #### Section 8 : premapped cells ####
           #########################################################
####################################################################################


####################################################################################

